In [ ]:
import pandas as pd # 판다스를 pd라고 부르겠다

In [5]:
data_list = [
    ["소라", 25, "인천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"]
]

columns = ["이름", "나이", "거주지"]

df = pd.DataFrame(data_list, columns=columns)

df

   이름  나이 거주지
0  소라  25  인천
1  창훈  30  순천
2  영미  35  동해

In [6]:
# 02 파일을 데이터프레임으로 가져오기

import pandas as pd

df = pd.read_excel("sales_data.xlsx")
df

           날짜  제품명  판매량    단가    총판매액
0  2023-01-01  제품A  100  1200  120000
1  2023-01-02  제품B  150  1500  225000
2  2023-01-03  제품C  200  1300  260000
3  2023-01-04  제품D  170  1600  272000

In [2]:
# 03 데이터프레임을 파일로 저장하기

import pandas as pd

data = [
    [1, "파이썬 프로그래밍", "김파이썬", 2019],
    [2, "데이터 분석", "이데이터", 2020],
    [3, "머신러닝 입문", "박머신", 2018],
    [4, "인공지능의 이해", "최인공", 2021]
]

columns = ["도서ID", "도서명", "저자", "출판년도"]

books_df = pd.DataFrame(data, columns=columns)

books_df.to_excel("도서_데이터.xlsx")

books_df

   도서ID        도서명    저자  출판년도
0     1  파이썬 프로그래밍  김파이썬  2019
1     2     데이터 분석  이데이터  2020
2     3    머신러닝 입문   박머신  2018
3     4   인공지능의 이해   최인공  2021

In [42]:
# 04 shape, columns 속성으로 데이터프레임 정보 파악하기

import pandas as pd

data = [
    ["김철수", 25, "서울"],
    ["이영희", 32, "부산"],
    ["김철수", 25, "서울"],
    ["이영희", 32, "부산"],
    ["김철수", 25, "서울"],
    ["이영희", 32, "부산"],
    ["박민수", 19, "대구"]
]

columns = ["이름", "나이", "도시"]

df = pd.DataFrame(data, columns=columns)

print(df.shape)

df

(7, 3)

    이름  나이  도시
0  김철수  25  서울
1  이영희  32  부산
2  김철수  25  서울
3  이영희  32  부산
4  김철수  25  서울
5  이영희  32  부산
6  박민수  19  대구

In [62]:
print(df.columns)

Index(['이름', '나이', '도시'], dtype='object')

In [61]:
# 05 head()함수, tail()함수로 데이터 엿보기

import pandas as pd

data = [
    ["김철수", 25, "서울"],
    ["이영희", 32, "부산"],
    ["박민수", 19, "대구"]
]

columns = ["이름", "나이", "도시"]

df = pd.DataFrame(data, columns=columns)

print(df.head(1))

print(df.tail(1))

    이름  나이  도시
0  김철수  25  서울
    이름  나이  도시
2  박민수  19  대구

In [60]:
# 06 열 이름 또는 인덱스로 데이터 선택하기

column_data = df["도시"]

print(type(column_data))

print(column_data)

<class 'pandas.core.series.Series'>
0    서울
1    부산
2    서울
3    부산
4    서울
5    부산
6    대구
Name: 도시, dtype: object

In [59]:
seleced_columns = df[["도시", "이름"]]

print(type(seleced_columns))

print(seleced_columns)

<class 'pandas.core.frame.DataFrame'>
   도시   이름
0  서울  김철수
1  부산  이영희
2  서울  김철수
3  부산  이영희
4  서울  김철수
5  부산  이영희
6  대구  박민수

In [58]:
column_data = df[["도시"]]
column_data

   도시
0  서울
1  부산
2  서울
3  부산
4  서울
5  부산
6  대구

In [57]:
# 행 선택하기

row = df.loc[0]
print(row)

이름    김철수
나이     25
도시     서울
Name: 0, dtype: object

In [56]:
# 인덱싱

seleced_rows1 = df.loc[[0, 2]]
print(seleced_rows1)

    이름  나이  도시
0  김철수  25  서울
2  김철수  25  서울

In [55]:
# 슬라이싱

seleced_rows2 = df.loc[1:2]
print(seleced_rows2)

    이름  나이  도시
1  이영희  32  부산
2  김철수  25  서울

In [54]:
seleced_column = df.loc[:, "도시"]

print(seleced_column)

0    서울
1    부산
2    서울
3    부산
4    서울
5    부산
6    대구
Name: 도시, dtype: object

In [53]:
seleced_column1 = df.loc[:, ["도시", "이름"]]
print(seleced_column1)

   도시   이름
0  서울  김철수
1  부산  이영희
2  서울  김철수
3  부산  이영희
4  서울  김철수
5  부산  이영희
6  대구  박민수

In [52]:
seleced_column2 = df.loc[:, "나이":"도시"]
print(seleced_column2)

   나이  도시
0  25  서울
1  32  부산
2  25  서울
3  32  부산
4  25  서울
5  32  부산
6  19  대구

In [51]:
seleced_value = df.loc[0 , "이름"]
print(seleced_value)

김철수

In [49]:
# iloc[]

row = df.iloc[0]

column = df.iloc[:, 1]

print(row)
print("-----------------------")
print("column")

이름    김철수
나이     25
도시     서울
Name: 0, dtype: object
-----------------------
column

In [48]:
last_column = df.iloc[:, -1]

print(last_column)

0    서울
1    부산
2    서울
3    부산
4    서울
5    부산
6    대구
Name: 도시, dtype: object

In [47]:
rows_iloc = df.iloc[0:2]

columns_iloc = df.iloc[:, 1:2]

print(rows_iloc)
print("-----------------------")
print(columns_iloc)

    이름  나이  도시
0  김철수  25  서울
1  이영희  32  부산
-----------------------
   나이
0  25
1  32
2  25
3  32
4  25
5  32
6  19

In [46]:
rows_loc = df.loc[0:2]

columns_loc = df.loc[:, "나이":"도시"]

print(rows_loc)
print("---------------------")
print(columns_loc)

    이름  나이  도시
0  김철수  25  서울
1  이영희  32  부산
2  김철수  25  서울
---------------------
   나이  도시
0  25  서울
1  32  부산
2  25  서울
3  32  부산
4  25  서울
5  32  부산
6  19  대구

In [45]:
rows_list = df.iloc[[0, 2]]

columns_list = df.iloc[:, [0, 2]]

print(rows_list)
print("------------------------")
print(columns_list)

    이름  나이  도시
0  김철수  25  서울
2  김철수  25  서울
------------------------
    이름  도시
0  김철수  서울
1  이영희  부산
2  김철수  서울
3  이영희  부산
4  김철수  서울
5  이영희  부산
6  박민수  대구

In [44]:
selected_rows = df[0:2]

print(selected_rows)

    이름  나이  도시
0  김철수  25  서울
1  이영희  32  부산

In [43]:
# 조건으로 특정 데이터 필터링

filtered_rows1 = df[df["나이"]> 20]
print(filtered_rows1)

    이름  나이  도시
0  김철수  25  서울
1  이영희  32  부산
2  김철수  25  서울
3  이영희  32  부산
4  김철수  25  서울
5  이영희  32  부산

In [71]:
filtered_rows2 = df[(df["나이"]> 30) & (df["도시"] != "서울")]
print(filtered_rows2)

    이름  나이  도시
1  이영희  32  부산

In [72]:
조건 = df["도시"].isin(["대구", "부산"])

filtered_rows1_isin = df[조건]

print(filtered_rows1_isin)

    이름  나이  도시
1  이영희  32  부산
2  박민수  19  대구